---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefPlane
source: html/8e98c870-a6cb-3c0a-1743-d4adae4eab74.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentRefPlane Property

While making curved beam type "[Type Name]" some Reference Plane elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentRefPlane { get; }
```